app/views/volunteers/index.html.erb

  <%= f.label :area, "area" %>
  <%=  f.select :area, Volunteer.area_numbers.keys, {} , value: @search_params[:area]%>
---
SELECT `volunteers`.* FROM `volunteers`