app/views/users/show.html.erb

SELECT `volunteers`.* FROM `volunteers` WHERE `volunteers`.`user_id` = 1
---
<div class="volunteers-container">
  <% @user.volunteers.each do |t| %>