app/controllers/users_controller.rb

SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` != 2
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 7
---
  def index
    @entries_1 = Entry.all
    @entries_2 = Entry.where.not(user_id: current_user.id)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 7
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 3
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 4
---
  def show
    @user = User.find(params[:id])
    @currentUserEntry = Entry.where(user_id: current_user.id)
    @userEntry = Entry.where(user_id: @user.id)
    if @user.id == current_user.id
    else
      @currentUserEntry.each do |cu|
        @userEntry.each do |u|