app/controllers/volunteers_controller.rb

    def index
        @search_params = volunteer_search_params
        @volunteers = Volunteer.search(@search_params).includes(:user)
---
SELECT `volunteers`.* FROM `volunteers` WHERE ('2021-03-08' <= do_on) AND (do_on <= '2021-04-02') AND (東京都)

    def create
        @volunteer = Volunteer.new(volunteer_params)

        @volunteer.user_id = current_user.id

        if @volunteer.save
---
INSERT INTO `volunteers` (`title`, `area`, `from_area`, `gender`, `text`, `created_at`, `updated_at`, `user_id`, `do_on`) VALUES ('テスト3', '東京都', '問わない', '女性', 'yoroshiku', '2021-03-05 15:31:15.446095', '2021-03-05 15:31:15.446095', 1, '2021-03-10')

    def show
        @volunteer = Volunteer.find(params[:id])
---
SELECT `volunteers`.* FROM `volunteers` WHERE `volunteers`.`id` = 1 LIMIT 1

    def edit
        @volunteer = Volunteer.find(params[:id])
---
SELECT `volunteers`.* FROM `volunteers` WHERE `volunteers`.`id` = 7 LIMIT 1

    def update
        volunteer = Volunteer.find(params[:id])
---
SELECT `volunteers`.* FROM `volunteers` WHERE `volunteers`.`id` = 1 LIMIT 1

    def destroy
        volunteer = Volunteer.find(params[:id])
        volunteer.destroy
---
SELECT `volunteers`.* FROM `volunteers` WHERE `volunteers`.`id` = 1 LIMIT 1
DELETE FROM `volunteers` WHERE `volunteers`.`id` = 1